app/Controllers/Admin.php

    public function dashboard() {

        $session = session();
        $model = new UserModel();
        $data['user'] = $model->getDataPerson($session->get('pk_user'));


        $data['usuarios'] = $model->db->table('users')
                                  ->join('persons', 'persons.pk_phone = users.fk_phone')
                                  ->get()->getResultArray();
---
SELECT *
FROM `users`
JOIN `persons` ON `persons`.`pk_phone` = `users`.`fk_phone`

    public function assign()
{
    $tsModel = new \App\Models\TeacherStudentModel();
    $userModel = new \App\Models\Users(); // Tu modelo de usuarios

    // Usamos el UserModel para traer los select (Filtramos por fk_level)
    $data['teachers']    = $userModel->db->table('users u')->select('u.pk_user, p.nombre, p.apellido_paterno')
                           ->join('persons p', 'p.pk_phone = u.fk_phone')->where('u.fk_level', 2)->get()->getResultArray();

    $data['students']    = $userModel->db->table('users u')->select('u.pk_user, p.nombre, p.apellido_paterno')
                           ->join('persons p', 'p.pk_phone = u.fk_phone')->where('u.fk_level', 3)->get()->getResultArray();
---
SELECT `u`.`pk_user`, `p`.`nombre`, `p`.`apellido_paterno`
FROM `users` `u`
JOIN `persons` `p` ON `p`.`pk_phone` = `u`.`fk_phone`
WHERE `u`.`fk_level` = 2
SELECT `u`.`pk_user`, `p`.`nombre`, `p`.`apellido_paterno`
FROM `users` `u`
JOIN `persons` `p` ON `p`.`pk_phone` = `u`.`fk_phone`
WHERE `u`.`fk_level` = 3