app/Controllers/Auth.php

    public function processLogin(){
        helper('telegram'); // Cargas tu helper de Telegram
        $session = \Config\Services::session();
        $userModel = new Users();

        $rules = [
            'phone' => 'required|min_length[10]|numeric',
            'password' => 'required|min_length[6]'
        ];

        if(!$this->validate($rules)){
            return redirect()->back()->withInput()->with('errors',$this->validator->getErrors());
        }

        $data = [
            'phone' => $this->request->getPost('phone'),
            'password' => $this->request->getPost('password')
        ];

        // Buscamos al usuario
        $user = $userModel->where('fk_phone', $data['phone'])->first();
---
SELECT *
FROM `users`
WHERE `fk_phone` = '7121895039'
 LIMIT 1

            $expires = time() + 900; // Expira en 15 minutos

            // 2. Guardamos el token en la base de datos para este usuario
            $userModel->where('fk_phone', $user['fk_phone'])->set([
                'magic_token'   => $token,
                'magic_expires' => $expires
            ])->update();
---
UPDATE `users` SET `magic_token` = '4d98f1256ffbe831821d55683290cb31a584df693a36dc21eeb95779a438cf62', `magic_expires` = 1774386506
WHERE `fk_phone` = '7121895039'