app/Models/TeacherStudentModel.php

    public function getAllAssignments()
    {
        return $this->db->table($this->table . ' ts')
            ->select('
                ts.id,
                p_t.nombre as profe_n, p_t.apellido_paterno as profe_a,
                p_s.nombre as alumno_n, p_s.apellido_paterno as alumno_a
            ')
            ->join('users u_t', 'u_t.pk_user = ts.teacher_id') // Join para el profesor
            ->join('persons p_t', 'p_t.pk_phone = u_t.fk_phone')
            ->join('users u_s', 'u_s.pk_user = ts.student_id') // Join para el alumno
            ->join('persons p_s', 'p_s.pk_phone = u_s.fk_phone')
            ->orderBy('p_t.apellido_paterno', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `ts`.`id`, `p_t`.`nombre` as `profe_n`, `p_t`.`apellido_paterno` as `profe_a`, `p_s`.`nombre` as `alumno_n`, `p_s`.`apellido_paterno` as `alumno_a`
FROM `teacher_student` `ts`
JOIN `users` `u_t` ON `u_t`.`pk_user` = `ts`.`teacher_id`
JOIN `persons` `p_t` ON `p_t`.`pk_phone` = `u_t`.`fk_phone`
JOIN `users` `u_s` ON `u_s`.`pk_user` = `ts`.`student_id`
JOIN `persons` `p_s` ON `p_s`.`pk_phone` = `u_s`.`fk_phone`
ORDER BY `p_t`.`apellido_paterno` ASC