app/Models/Users.php

SELECT `users`.*, `persons`.`nombre`, `persons`.`apellido_paterno`, `persons`.`apellido_materno`, `persons`.`pk_phone`, `persons`.`gender`, `persons`.`birthdate`
FROM `users`
JOIN `persons` ON `persons`.`pk_phone`= `users`.`fk_phone`
WHERE `users`.`pk_user` = '17'
---
    public function getDataPerson($userId){
        return $this->db->table('users')
        ->select('users.*,persons.nombre,persons.apellido_paterno,persons.apellido_materno,persons.pk_phone,persons.gender,persons.birthdate')
        ->join('persons','persons.pk_phone= users.fk_phone')
        ->where('users.pk_user',$userId)
        ->get()
        ->getRowArray();